[
    {
        
        "intro": "Welcome to the Network Reconnaissance module! In this module, you will be introduced to the world of network reconnaissance and guide you through the basics of using NMAP, a powerful open-source network mapping tool. By the end of this module, you will have a foundational understanding of network reconnaissance and know how to use NMAP to perform simple network scans.",
        "section1_1": "Network reconnaissance, also known as network discovery or network enumeration, is the process of collecting information about a target network or system to identify potential vulnerabilities and weaknesses. It is an essential step in the cybersecurity process. The primary goal of network reconnaissance is to identify potential vulnerabilities, weaknesses, and points of entry that an attacker could exploit. It helps security professionals, network administrators, and ethical hackers to gain a better understanding of the target environment, which is essential for developing effective strategies for securing networks and systems.\n\nThere are two main types of network reconnaissance:\n",
        "section1_2": "This type of reconnaissance involves collecting information about the target without directly interacting with the target network or system. Passive reconnaissance techniques typically rely on publicly available information, such as DNS records, WHOIS data, search engine queries, and social media profiles. The goal is to gather as much information as possible without alerting the target to your presence.",
        "section1_3": "In contrast to passive reconnaissance, active reconnaissance involves directly interacting with the target network or system. This can include scanning for open ports, probing for running services, identifying operating systems, and even attempting to exploit known vulnerabilities. While active reconnaissance can yield more detailed and accurate information, it is also more likely to be detected by intrusion detection systems and other security measures.",
        "section1_4": "Common objectives of network reconnaissance include:\n\n-Identifying live hosts: Determining which devices are active and reachable within the target network is an essential first step in network reconnaissance. This information helps to narrow down the attack surface and prioritize targets.\n\n-Discovering open ports and running services: Open ports on target hosts may represent potential points of entry for attackers. Identifying these ports and the services running on them helps to assess the vulnerability of the target network.\n\n-Determining operating systems and software versions: Knowing the operating systems and software versions used by the target can provide valuable insight into potential vulnerabilities and help in tailoring the subsequent phases of a security assessment or penetration test.\n\n-Uncovering network topology: Understanding the layout and structure of the target network can help identify critical assets, such as servers, routers, and firewalls, as well as any existing security measures that may be in place.\n\n-Gathering user information: In some cases, collecting information about users, such as usernames, email addresses, and social media profiles, can be useful in planning social engineering attacks or other targeted campaigns.\n\nNetwork reconnaissance is a vital part of the cybersecurity process and serves as the foundation for further analysis, vulnerability assessment, and penetration testing. By thoroughly understanding the target environment, security professionals can better protect networks and systems from potential threats.\n\nLet's move on to the next page where we will begin to learn about the NMAP tool...",
        "section2_1": "NMAP, short for 'Network Mapper', is a versatile and widely-used network scanning tool that helps users discover hosts, services, and other valuable information about target networks. Since its initial release in 1997 by Gordon Lyon (Fyodor), NMAP has become an essential tool for network administrators, security researchers, and ethical hackers. Its versatility and robustness have made it the go-to choice for network scanning and reconnaissance tasks.\n\nNMAP boasts a wide range of features and scanning techniques, which include:\n",
        "section2_2": "This process identifies live hosts within the target network. It is essential for narrowing down the attack surface and prioritizing targets. NMAP supports various host discovery techniques, such as ICMP echo requests (ping), ARP requests, and TCP/UDP probes, allowing it to discover hosts even when they are behind firewalls or configured to ignore standard ping requests.",
        "section2_3": "NMAP can detect open ports on target hosts, which may represent potential points of entry for attackers. It supports numerous port scanning techniques, such as:\n\nTCP SYN scan: The default and fastest scanning method, which sends a TCP packet with the SYN (synchronize) flag set to initiate a connection with the target port.\n\nTCP Connect scan: A more reliable but slower method that establishes a full TCP connection with the target port, making it more likely to be detected by intrusion detection systems.\n\nUDP scan: Useful for scanning UDP (User Datagram Protocol) ports, which are connectionless and can be used by services like DNS, SNMP, and DHCP.\n\nStealth scans: Techniques like FIN, NULL, and Xmas scans are designed to avoid detection by sending unusual TCP packet combinations to the target port.",
        "section2_4": "NMAP can identify the services and their versions running on target hosts using its service/version detection engine. This feature is vital for uncovering vulnerable software and services that could be exploited by an attacker. NMAP's version detection uses a combination of probing and fingerprinting to accurately determine the service version.",
        "section2_5": "NMAP is capable of determining the operating systems of target hosts using its OS detection engine. It does this by sending a series of specially crafted packets to the target and analyzing the responses to deduce the operating system's characteristics. Accurate OS detection is crucial for tailoring the subsequent phases of a security assessment or penetration test to the specific target environment.",
        "section2_6": "NMAP includes the NMAP Scripting Engine (NSE), which allows users to extend its functionality using custom scripts written in Lua programming language. NSE scripts can be used for a wide range of purposes, including vulnerability detection, advanced version detection, and automation of various reconnaissance tasks.",
        "section2_7": "NMAP can generate scan results in various formats, such as plain text, XML, JSON, and even HTML. These output formats enable users to easily parse, analyze, and visualize scan data using other tools or custom scripts.",
        "section2_8": "You can install NMAP on your computer if you want. It is available for Windows, Linux, and macOS. Visit the official NMAP website (https://nmap.org/download.html) to download and install the appropriate version for your operating system. However, this module will provide a simulated terminal for you to practice NMAP commands on, so you don't have to install NMAP on your computer.\n",
        "section3_1": "A Unix terminal, also known as a command-line interface (CLI), is a powerful tool that enables users to interact with Unix-based operating systems (e.g., Linux, macOS) by typing textual commands. It provides greater control and flexibility compared to graphical user interfaces (GUIs), which rely on visual elements like buttons and menus for user interaction. In a Unix terminal, users can perform various tasks, such as navigating the file system, creating and editing files, installing and managing software, and executing scripts or programs. It is especially useful for system administration, programming, and other advanced tasks, as it allows users to automate processes and perform complex operations more efficiently.",
        "section3_2": "It has an input field and an output box. A real terminal isn't actually like this, but it is easier to start using it this way.",
        "section3_3": "Command flags, also known as options or switches, are special parameters used in command-line applications to modify or control the behavior of a specific command. Flags usually start with a single hyphen followed by a single letter (e.g., -a) or with two hyphens followed by a longer, descriptive word (e.g., --all). They are entered along with the command to provide additional instructions, customize the output, or enable/disable certain features. Flags can be combined, and some may require an accompanying value to specify the desired behavior further.",
        "section3_4": "Now let's actually scan a target. Type in 'nmap google.com'",
        "section3_5": "As you can see, this brings up the help page for NMAP. Typing 'nmap -h' does the same thing. -h is a command flag.",
        "section3_6": "You have just performed a successful NMAP scan of Google. As you can see, Google has two ports open: port 80, or http, and port 443, or https. Google has to have these ports open because these are the standard ports used for web traffic. Port 80 is the default port for HTTP (Hypertext Transfer Protocol), which is used to transmit web pages and other resources between a web server and a user's browser. Port 443 is the default port for HTTPS (HTTP Secure), which is a secure version of HTTP that encrypts data between the server and the browser using SSL/TLS protocols to ensure privacy and data integrity. If we wanted to, we could use other tools to probe these ports and gather more information, but as we are just at the recon stage of our investigation, we'll simply make a note of these ports. We don't usually use URLS (e.g. google.com) with NMAP, we use IP addresses instead. Type in 'nmap 142.250.187.238' now.",
        "section3_7": "We get the exact same output. That's because 142.250.187.238 is the IP address of google.com. If we wanted more information when scanning a target, we can increase the verbosity of the scan. We can do this by supplying the '-v' command flag to NMAP. Go ahead and type in 'nmap -v 142.250.187.238' (or 'nmap -v google.com')",
        "section3_8": "We now get a lot more information about what's going on during the scan. We get info about when NMAP connects to the target successfully and when it discovers an open port. Let's do one more scan - an OS detection scan. Finding out what OS a server is running is incredibly usefull. If you know what OS and OS version a server is running, you can exploit known vulnerabilities of that OS. Type 'nmap -O 142.250.187.238' (or 'nmap -O google.com')",
        "section3_9": "NMAP gives us all the info it could find about the OS and version of the server. Since we are scanning Google, they have very good cybersecurity, which results in NMAP having a hard time detecting the exact OS and version. It gives us three possible OSs the server is running as well as the percentage likelyhood of that OS being the correct one.",
        "section3_10": "Congratulations! You now have a basic understanding of Network Recon and can conduct simple NMAP scans in a Unix terminal.",
        "section3_11": "You're going to use it to practice basic NMAP commands. Begin by simply typing 'nmap' in the terminal and press enter.",
        "section3_12": "Looks like you entered in the wrong command. Type 'clear' into the terminal to restart"
        
    }
]
